read_verilog -sv example/counter.sv
read_liberty -lib minecraft.lib
synth
dff2dffe
abc -liberty minecraft.lib
stat
show counter
